---
kind: method
id: M:Autodesk.Revit.DB.Definitions.#ctor
source: html/3af1491a-2a6d-d5c7-1e54-c8ac642dd257.htm
---
# Autodesk.Revit.DB.Definitions.#ctor Method

Constructs an empty set of parameter definitions.

## Syntax (C#)
```csharp
public Definitions()
```